IDEA Open Model
LineSupportSegment.SupportTypeRX Property
 Support type in dirrection round X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public SupportTypeInDirrection SupportTypeRX { get; set; }
Public Property SupportTypeRX As SupportTypeInDirrection
	Get
	Set
public:
property SupportTypeInDirrection SupportTypeRX {
	SupportTypeInDirrection get ();
	void set (SupportTypeInDirrection value);
}
Property Value
Type: SupportTypeInDirrection
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace